//////////////////////////////////////////////////////
//
//Author: Alejandro Armenta 
//Date: 2019
//File: eaglefly_decoder.cpp
//Company: 
//
//All rights reserved.
//
//////////////////////////////////////////////////////

/*

NOTE(Alex): eaglefly_disasm___.h
//NOTE(Alex): EagleFly Disasm
Platform independednt disassembler 


IMPORTANT(Alex): Intel Instruction Format Manual Pages

- Effective Operand Size and Address Size Attributes                           83
- Programming with General purpose Instructions                               169
- Instruction Set Reference Index                                             478
- Instruction Format (General) 16/32-bit MODRM and 32-bit SIB tables          505
- Instruction Set Reference A-L                                               573
- Appendix A Opcode Map                                                      2497
- Appendix B Instruction formats en encodings                                2527
- Instructions Index                                                          479
- EFLAGS condition codes table                                                417

- TODO(Alex): x87 FPU reading                                                 198 
- MS MASM 6.0 Programmer’s Guide                                        5.1.3.2  String Instructions
Windows Internals - Terminal Services and multiple sessions
Programming the windows driver model                                    2.2.3 Legacy Devices 
Instruction set summary


Making binary patching -keep functions the same size so that you dont modify other sections' code.

data vs code
-dense ISA - most opcode values are occupied therefore you cannot use it to identify 
-the instruction set is variable length - you dont where does the next code or data piece will start
-memory unaligned accessess - therefore identifying data by its sections is not possible
-if you have symbol information access then you know where each function is! and how it is called how nice isnt it?
but that's not the normal case so probably leave as an option.

/////////////////////////////////////////////////////////////////////////////    

    NOTE(Alex): Opcode ID's layout
    
    when instruction operands must be memory operands, per example FISTP <Mqi> the opcode id will look like something like this
    
    0xDF mod 7 rm
    
    later on using the grammar we assert that mod < 3 so that we make sure is a valid instruction, if not we treat it as data.
    
    Instruction Prefixes:
	
CHECKED (16,32,64 modes) 
Repeat prefixes REP/REPNE are used with: 
MOVS, 
SCAS, 
LODS,
STOS, 
CMPS, 
INS,
OUTS


LOCK prefix used with these insruction only when dest operand is a memory operand: 
ADD, 
ADC,
AND,
BTC,  
BTR,
BTS, 
CMPXCHG, 
CMPXCHG8B,
CMPXCHG16B, 
DEC, 
INC, 
NEG, 
NOT, 
OR, 
SBB, 
SUB, 
XOR, 
XADD, 
XCHG



Branch hint prefixes (2EH, 3EH)
only with conditional branch instructions (Jcc).

Control transfer instructions:

reltaive address - is an offset with respect to the address of the EIP register.
The destination address a near pointer is formed by adding the displacement to the address in the EIP register.
Jumps can be forward or backward.

Absolute address is an offset from address 0 of a segment. two ways:

-an address in a GPR - near pointer, which is copied into the EIP register.
-an address specified using the standard addressing modes of the processor. here the address can be a near pointer or a far pointer
-  If far pointer: 
-     segment selector -> CS
-     offset -> EIP

-  If near pointer:
-     offset -> EIP

unconditional - near transfer or far transfer

JMP - the transfer is one way, no return instruction pointer is saved - 
the address can be a relative address or an absolute address.
In protected mode the JMP instruction also allows jumps to a call gate, a task gate, and a task state segment.

CALL - 
RET n - the n values removed from the stack are removed after the Return IP Value is loaded back on RIP. 

INT - the contents of the EFLAGS register are stored on the stack along with the return instruction pointer before servicing the interrupt
IRET - similar to RET except that also pops EFLAGS from the stack to the EFLAGS register.

conditional -

Jcc - relative address - doesnt allow far transfers.
JCXZ - test the rCX register

LOOP - decrement RCX register then Compare if equal to zero 

JECXZ after_loop
begin_loop:

;some code

LOOP begin_loop
after_loop:

software interrupts


THINGS TO DO:

Fast structure look up! 
- structure identification
0: kd> dt nt!_KINTERRUPT
   +0x000 Type             : Int2B
   +0x002 Size             : Int2B
   +0x008 InterruptListEntry : _LIST_ENTRY
          0: kd> dt nt!_LIST_ENTRY
          +0x000 Flink            : Ptr64 _LIST_ENTRY
          +0x008 Blink            : Ptr64 _LIST_ENTRY
		  
   +0x018 ServiceRoutine   : Ptr64     unsigned char 
   +0x020 MessageServiceRoutine : Ptr64     unsigned char 
   +0x028 MessageIndex     : Uint4B
   +0x030 ServiceContext   : Ptr64 Void
   +0x038 SpinLock         : Uint8B
   +0x040 TickCount        : Uint4B
   +0x048 ActualLock       : Ptr64 Uint8B
   +0x050 DispatchAddress  : Ptr64     void 
   +0x058 Vector           : Uint4B
   +0x05c Irql             : UChar
   +0x05d SynchronizeIrql  : UChar
   +0x05e FloatingSave     : UChar
   +0x05f Connected        : UChar
   +0x060 Number           : Uint4B
   +0x064 ShareVector      : UChar
   +0x065 EmulateActiveBoth : UChar
   +0x066 ActiveCount      : Uint2B
   +0x068 InternalState    : Int4B
   +0x06c Mode             : _KINTERRUPT_MODE
          0: kd> dt nt!_KINTERRUPT_MODE
          LevelSensitive = 0n0
          Latched = 0n1
		  
		  
   +0x070 Polarity         : _KINTERRUPT_POLARITY
      0: kd> dt nt!_KINTERRUPT_POLARITY
      InterruptPolarityUnknown = 0n0
      InterruptActiveHigh = 0n1
      InterruptRisingEdge = 0n1
      InterruptActiveLow = 0n2
      InterruptFallingEdge = 0n2
      InterruptActiveBoth = 0n3
      InterruptActiveBothTriggerLow = 0n3
      InterruptActiveBothTriggerHigh = 0n4
	  
   +0x074 ServiceCount     : Uint4B
   +0x078 DispatchCount    : Uint4B
   +0x080 PassiveEvent     : Ptr64 _KEVENT
   0: kd> dt nt!_KEVENT
      +0x000 Header           : _DISPATCHER_HEADER
	  
   +0x088 TrapFrame        : Ptr64 _KTRAP_FRAME
      0: kd> dt nt!_KTRAP_FRAME
         +0x000 P1Home           : Uint8B
         +0x008 P2Home           : Uint8B
         +0x010 P3Home           : Uint8B
         +0x018 P4Home           : Uint8B
         +0x020 P5               : Uint8B
         +0x028 PreviousMode     : Char
         +0x029 PreviousIrql     : UChar
         +0x02a FaultIndicator   : UChar
         +0x02b ExceptionActive  : UChar
         +0x02c MxCsr            : Uint4B
         +0x030 Rax              : Uint8B
         +0x038 Rcx              : Uint8B
         +0x040 Rdx              : Uint8B
         +0x048 R8               : Uint8B
         +0x050 R9               : Uint8B
         +0x058 R10              : Uint8B
         +0x060 R11              : Uint8B
         +0x068 GsBase           : Uint8B
         +0x068 GsSwap           : Uint8B
         +0x070 Xmm0             : _M128A
         +0x080 Xmm1             : _M128A
         +0x090 Xmm2             : _M128A
         +0x0a0 Xmm3             : _M128A
         +0x0b0 Xmm4             : _M128A
         +0x0c0 Xmm5             : _M128A
         +0x0d0 FaultAddress     : Uint8B
         +0x0d0 ContextRecord    : Uint8B
         +0x0d0 TimeStampCKCL    : Uint8B
         +0x0d8 Dr0              : Uint8B
         +0x0e0 Dr1              : Uint8B
         +0x0e8 Dr2              : Uint8B
         +0x0f0 Dr3              : Uint8B
         +0x0f8 Dr6              : Uint8B
         +0x100 Dr7              : Uint8B
         +0x108 DebugControl     : Uint8B
         +0x110 LastBranchToRip  : Uint8B
         +0x118 LastBranchFromRip : Uint8B
         +0x120 LastExceptionToRip : Uint8B
         +0x128 LastExceptionFromRip : Uint8B
         +0x130 SegDs            : Uint2B
         +0x132 SegEs            : Uint2B
         +0x134 SegFs            : Uint2B
         +0x136 SegGs            : Uint2B
         +0x138 TrapFrame        : Uint8B
         +0x140 Rbx              : Uint8B
         +0x148 Rdi              : Uint8B
         +0x150 Rsi              : Uint8B
         +0x158 Rbp              : Uint8B
         +0x160 ErrorCode        : Uint8B
         +0x160 ExceptionFrame   : Uint8B
         +0x160 TimeStampKlog    : Uint8B
         +0x168 Rip              : Uint8B
         +0x170 SegCs            : Uint2B
         +0x172 Fill0            : UChar
         +0x173 Logging          : UChar
         +0x174 Fill1            : [2] Uint2B
         +0x178 EFlags           : Uint4B
         +0x17c Fill2            : Uint4B
         +0x180 Rsp              : Uint8B
         +0x188 SegSs            : Uint2B
         +0x18a Fill3            : Uint2B
         +0x18c Fill4            : Uint4B
		 
   +0x090 DisconnectData   : Ptr64 Void
   +0x098 ServiceThread    : Ptr64 _KTHREAD
0: kd> dt nt!_KTHREAD
   +0x000 Header           : _DISPATCHER_HEADER
   +0x018 SListFaultAddress : Ptr64 Void
   +0x020 QuantumTarget    : Uint8B
   +0x028 InitialStack     : Ptr64 Void
   +0x030 StackLimit       : Ptr64 Void
   +0x038 StackBase        : Ptr64 Void
   +0x040 ThreadLock       : Uint8B
   +0x048 CycleTime        : Uint8B
   +0x050 CurrentRunTime   : Uint4B
   +0x054 ExpectedRunTime  : Uint4B
   +0x058 KernelStack      : Ptr64 Void
   +0x060 StateSaveArea    : Ptr64 _XSAVE_FORMAT
   +0x068 SchedulingGroup  : Ptr64 _KSCHEDULING_GROUP
   +0x070 WaitRegister     : _KWAIT_STATUS_REGISTER
   +0x071 Running          : UChar
   +0x072 Alerted          : [2] UChar
   +0x074 AutoBoostActive  : Pos 0, 1 Bit
   +0x074 ReadyTransition  : Pos 1, 1 Bit
   +0x074 WaitNext         : Pos 2, 1 Bit
   +0x074 SystemAffinityActive : Pos 3, 1 Bit
   +0x074 Alertable        : Pos 4, 1 Bit
   +0x074 UserStackWalkActive : Pos 5, 1 Bit
   +0x074 ApcInterruptRequest : Pos 6, 1 Bit
   +0x074 QuantumEndMigrate : Pos 7, 1 Bit
   +0x074 UmsDirectedSwitchEnable : Pos 8, 1 Bit
   +0x074 TimerActive      : Pos 9, 1 Bit
   +0x074 SystemThread     : Pos 10, 1 Bit
   +0x074 ProcessDetachActive : Pos 11, 1 Bit
   +0x074 CalloutActive    : Pos 12, 1 Bit
   +0x074 ScbReadyQueue    : Pos 13, 1 Bit
   +0x074 ApcQueueable     : Pos 14, 1 Bit
   +0x074 ReservedStackInUse : Pos 15, 1 Bit
   +0x074 UmsPerformingSyscall : Pos 16, 1 Bit
   +0x074 TimerSuspended   : Pos 17, 1 Bit
   +0x074 SuspendedWaitMode : Pos 18, 1 Bit
   +0x074 SuspendSchedulerApcWait : Pos 19, 1 Bit
   +0x074 Reserved         : Pos 20, 12 Bits
   +0x074 MiscFlags        : Int4B
   +0x078 AutoAlignment    : Pos 0, 1 Bit
   +0x078 DisableBoost     : Pos 1, 1 Bit
   +0x078 ThreadFlagsSpare0 : Pos 2, 1 Bit
   +0x078 AlertedByThreadId : Pos 3, 1 Bit
   +0x078 QuantumDonation  : Pos 4, 1 Bit
   +0x078 EnableStackSwap  : Pos 5, 1 Bit
   +0x078 GuiThread        : Pos 6, 1 Bit
   +0x078 DisableQuantum   : Pos 7, 1 Bit
   +0x078 ChargeOnlySchedulingGroup : Pos 8, 1 Bit
   +0x078 DeferPreemption  : Pos 9, 1 Bit
   +0x078 QueueDeferPreemption : Pos 10, 1 Bit
   +0x078 ForceDeferSchedule : Pos 11, 1 Bit
   +0x078 SharedReadyQueueAffinity : Pos 12, 1 Bit
   +0x078 FreezeCount      : Pos 13, 1 Bit
   +0x078 TerminationApcRequest : Pos 14, 1 Bit
   +0x078 AutoBoostEntriesExhausted : Pos 15, 1 Bit
   +0x078 KernelStackResident : Pos 16, 1 Bit
   +0x078 CommitFailTerminateRequest : Pos 17, 1 Bit
   +0x078 ProcessStackCountDecremented : Pos 18, 1 Bit
   +0x078 ThreadFlagsSpare : Pos 19, 5 Bits
   +0x078 EtwStackTraceApcInserted : Pos 24, 8 Bits
   +0x078 ThreadFlags      : Int4B
   +0x07c Tag              : UChar
   +0x07d SystemHeteroCpuPolicy : UChar
   +0x07e UserHeteroCpuPolicy : Pos 0, 7 Bits
   +0x07e ExplicitSystemHeteroCpuPolicy : Pos 7, 1 Bit
   +0x07f Spare0           : UChar
   +0x080 SystemCallNumber : Uint4B
   +0x084 Spare10          : Uint4B
   +0x088 FirstArgument    : Ptr64 Void
   +0x090 TrapFrame        : Ptr64 _KTRAP_FRAME
   +0x098 ApcState         : _KAPC_STATE
   +0x098 ApcStateFill     : [43] UChar
   +0x0c3 Priority         : Char
   +0x0c4 UserIdealProcessor : Uint4B
   +0x0c8 WaitStatus       : Int8B
   +0x0d0 WaitBlockList    : Ptr64 _KWAIT_BLOCK
   +0x0d8 WaitListEntry    : _LIST_ENTRY
   +0x0d8 SwapListEntry    : _SINGLE_LIST_ENTRY
   +0x0e8 Queue            : Ptr64 _DISPATCHER_HEADER
   +0x0f0 Teb              : Ptr64 Void
   +0x0f8 RelativeTimerBias : Uint8B
   +0x100 Timer            : _KTIMER
   +0x140 WaitBlock        : [4] _KWAIT_BLOCK
   +0x140 WaitBlockFill4   : [20] UChar
   +0x154 ContextSwitches  : Uint4B
   +0x140 WaitBlockFill5   : [68] UChar
   +0x184 State            : UChar
   +0x185 Spare13          : Char
   +0x186 WaitIrql         : UChar
   +0x187 WaitMode         : Char
   +0x140 WaitBlockFill6   : [116] UChar
   +0x1b4 WaitTime         : Uint4B
   +0x140 WaitBlockFill7   : [164] UChar
   +0x1e4 KernelApcDisable : Int2B
   +0x1e6 SpecialApcDisable : Int2B
   +0x1e4 CombinedApcDisable : Uint4B
   +0x140 WaitBlockFill8   : [40] UChar
   +0x168 ThreadCounters   : Ptr64 _KTHREAD_COUNTERS
   +0x140 WaitBlockFill9   : [88] UChar
   +0x198 XStateSave       : Ptr64 _XSTATE_SAVE
   +0x140 WaitBlockFill10  : [136] UChar
   +0x1c8 Win32Thread      : Ptr64 Void
   +0x140 WaitBlockFill11  : [176] UChar
   +0x1f0 Ucb              : Ptr64 _UMS_CONTROL_BLOCK
   +0x1f8 Uch              : Ptr64 _KUMS_CONTEXT_HEADER
   +0x200 TebMappedLowVa   : Ptr64 Void
   +0x208 QueueListEntry   : _LIST_ENTRY
   +0x218 NextProcessor    : Uint4B
   +0x218 NextProcessorNumber : Pos 0, 31 Bits
   +0x218 SharedReadyQueue : Pos 31, 1 Bit
   +0x21c QueuePriority    : Int4B
   +0x220 Process          : Ptr64 _KPROCESS
   +0x228 UserAffinity     : _GROUP_AFFINITY
   +0x228 UserAffinityFill : [10] UChar
   +0x232 PreviousMode     : Char
   +0x233 BasePriority     : Char
   +0x234 PriorityDecrement : Char
   +0x234 ForegroundBoost  : Pos 0, 4 Bits
   +0x234 UnusualBoost     : Pos 4, 4 Bits
   +0x235 Preempted        : UChar
   +0x236 AdjustReason     : UChar
   +0x237 AdjustIncrement  : Char
   +0x238 AffinityVersion  : Uint8B
   +0x240 Affinity         : _GROUP_AFFINITY
   +0x240 AffinityFill     : [10] UChar
   +0x24a ApcStateIndex    : UChar
   +0x24b WaitBlockCount   : UChar
   +0x24c IdealProcessor   : Uint4B
   +0x250 NpxState         : Uint8B
   +0x258 SavedApcState    : _KAPC_STATE
   +0x258 SavedApcStateFill : [43] UChar
   +0x283 WaitReason       : UChar
   +0x284 SuspendCount     : Char
   +0x285 Saturation       : Char
   +0x286 SListFaultCount  : Uint2B
   +0x288 SchedulerApc     : _KAPC
   +0x288 SchedulerApcFill0 : [1] UChar
   +0x289 ResourceIndex    : UChar
   +0x288 SchedulerApcFill1 : [3] UChar
   +0x28b QuantumReset     : UChar
   +0x288 SchedulerApcFill2 : [4] UChar
   +0x28c KernelTime       : Uint4B
   +0x288 SchedulerApcFill3 : [64] UChar
   +0x2c8 WaitPrcb         : Ptr64 _KPRCB
   +0x288 SchedulerApcFill4 : [72] UChar
   +0x2d0 LegoData         : Ptr64 Void
   +0x288 SchedulerApcFill5 : [83] UChar
   +0x2db CallbackNestingLevel : UChar
   +0x2dc UserTime         : Uint4B
   +0x2e0 SuspendEvent     : _KEVENT
   +0x2f8 ThreadListEntry  : _LIST_ENTRY
   +0x308 MutantListHead   : _LIST_ENTRY
   +0x318 AbEntrySummary   : UChar
   +0x319 AbWaitEntryCount : UChar
   +0x31a Spare20          : Uint2B
   +0x31c SecureThreadCookie : Uint4B
   +0x320 LockEntries      : [6] _KLOCK_ENTRY
   +0x560 PropagateBoostsEntry : _SINGLE_LIST_ENTRY
   +0x568 IoSelfBoostsEntry : _SINGLE_LIST_ENTRY
   +0x570 PriorityFloorCounts : [16] UChar
   +0x580 PriorityFloorSummary : Uint4B
   +0x584 AbCompletedIoBoostCount : Int4B
   +0x588 KeReferenceCount : Int2B
   +0x58a AbOrphanedEntrySummary : UChar
   +0x58b AbOwnedEntryCount : UChar
   +0x58c ForegroundLossTime : Uint4B
   +0x590 GlobalForegroundListEntry : _LIST_ENTRY
   +0x590 ForegroundDpcStackListEntry : _SINGLE_LIST_ENTRY
   +0x598 InGlobalForegroundList : Uint8B
   +0x5a0 ReadOperationCount : Int8B
   +0x5a8 WriteOperationCount : Int8B
   +0x5b0 OtherOperationCount : Int8B
   +0x5b8 ReadTransferCount : Int8B
   +0x5c0 WriteTransferCount : Int8B
   +0x5c8 OtherTransferCount : Int8B
   +0x5d0 QueuedScb        : Ptr64 _KSCB
   
   +0x0a0 ConnectionData   : Ptr64 _INTERRUPT_CONNECTION_DATA
        0: kd> dt nt!_INTERRUPT_CONNECTION_DATA
        +0x000 Count            : Uint4B
        +0x008 Vectors          : [1] _INTERRUPT_VECTOR_DATA
		
   +0x0a8 IntTrackEntry    : Ptr64 Void
   +0x0b0 IsrDpcStats      : _ISRDPCSTATS
         0: kd> dt nt!_ISRDPCSTATS
            +0x000 IsrTime          : Uint8B
            +0x008 IsrTimeStart     : Uint8B
            +0x010 IsrCount         : Uint8B
            +0x018 DpcTime          : Uint8B
            +0x020 DpcTimeStart     : Uint8B
            +0x028 DpcCount         : Uint8B
            +0x030 IsrActive        : UChar
            +0x031 Reserved         : [15] UChar
			
   +0x0f0 RedirectObject   : Ptr64 Void
   +0x0f8 Padding          : [8] UChar
   
   
- structure tree layout - note when there is cycle dependency as in DOUBLY LINKED LISTS stop on the 2nd iteration
OR you can put a level of recursion as a specifier for the structure search.





PE32 exec/PE32+ exec/DLL static (shared)/DLL dynamic (shared)/COFF/LIB/ File size limit - 2 gigabytes

DLL (shared) dependency resolver - so i can resolve all dependencies and disasm all of them if the user wants!

Data resolver - Identify data and code ? how to do it, etc. globals, statics, unitialized variables, TLS, DLL pointer tables, INIT pointer tables, FINIT pointer tables, 
Type resolver - what type the data is???
-
----> for obj - probably not so difficult - debug symbol information and symbol tables.


BaseOfData - what is that? and what does it represent for asm file? - Data resolver
BaseOfCode - what is that? and what does it represent for asm file?
ImageBase - what is that? and what does it represent for asm file?
